Revit 2026 API

# HardwoodHardwoodColor Property

---

The property labeled "Image" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodColor { get; }
```
```vb
Public Shared ReadOnly Property HardwoodColor As String
	Get
```
```cpp
public:
static property String^ HardwoodColor {
	String^ get ();
}
```
```fsharp
static member HardwoodColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace